ams/src/DataProcessors/AMS_Продажи/AMS_Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AMS_Продажи</name>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПартнеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продажи</name>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказКлиента</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>СостоянияЗаказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОтгрузкаТоваровКлиенту</types>
      </type>
    </attributes>
    <attributes>
      <name>СостоянияРеализация</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерРеализация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРеализация</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаДоступа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Срок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловияОтгрузки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПалет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИзмененаЗаказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИзмененаРеализация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>В2В</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПросроченЗаказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПросроченРеализация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Лимит</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЛимит</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДолгКлиентаПросрочен</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДолгНаш</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденаОтгрузка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сальдо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьСН</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьУПД</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьЛист</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ams/src/InformationRegisters/AMS_ИсторияРеализации/AMS_ИсторияРеализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AMS_ИсторияРеализации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Операция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Событие</name>
    <type>
      <types>EnumRef.AMS_СобытияРеализации</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <types>EnumRef.AMS_СтатусыРеализаций</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </resources>
  <resources>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛогистическийЛист</name>
    <type>
      <types>DocumentRef.AMS_ЛогистическийЛист</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/Enums/AMS_СтатусыРеализаций/AMS_СтатусыРеализаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_СтатусыРеализаций</name>
  <enumValues>
    <name>Заказ</name>
  </enumValues>
  <enumValues>
    <name>Стикерование</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружено</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоРаспискеЭкспедитора</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоСканДов</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоДов</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоУПД</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоСканДов_УПД</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоУПДестьТНнет</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаБезДоверенности</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ_12_Удалить</name>
  </enumValues>
</mdclass:Enum>

ams/src/Enums/_СтатусыДоставки/_СтатусыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>_СтатусыДоставки</name>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>Погрузка</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
</mdclass:Enum>

ams/src/Enums/AMS_СобытияРеализации/AMS_СобытияРеализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_СобытияРеализации</name>
  <enumValues>
    <name>Запись</name>
  </enumValues>
  <enumValues>
    <name>Проведение</name>
  </enumValues>
  <enumValues>
    <name>ОтменаПроведения</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>ОтменаОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>Погрузка</name>
  </enumValues>
  <enumValues>
    <name>ОтменаПогрузки</name>
  </enumValues>
  <enumValues>
    <name>РазрешитьОтгрузку</name>
  </enumValues>
  <enumValues>
    <name>ОтменаРазрешенияОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ПечатьСН</name>
  </enumValues>
  <enumValues>
    <name>ПечатьТОРГ12</name>
  </enumValues>
  <enumValues>
    <name>ПечатьУПД</name>
  </enumValues>
  <enumValues>
    <name>ОтменаПечати</name>
  </enumValues>
</mdclass:Enum>

ams/src/DataProcessors/AMS_Продажи/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьТаблицуПродажи() Экспорт
	Если Пользователи.РолиДоступны("_НачальникСклада, _КладовщикСклада") Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Табл = ПолучитьДокументыПродажи();
	
	Продажи.Очистить();
	
	НомерСтроки  = 0;
	ДатаОтгрузки = Неопределено;
	
	Для Каждого Стр Из Табл Цикл
		НовСтр = Продажи.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		
		Если Не ДатаОтгрузки = НовСтр.ДатаОтгрузки Тогда
			ДатаОтгрузки = НовСтр.ДатаОтгрузки;	
			НомерСтроки  = 0;
		КонецЕсли;	
			
		НомерСтроки = НомерСтроки + 1;
		
		НовСтр.Номер             = Сред(Стр.Номер, 2, 1) + Сред(ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Стр.Номер), 2);
		НовСтр.НомерРеализация   = Сред(Стр.НомерРеализация, 2, 1) + Сред(ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Стр.НомерРеализация), 2);
		
		Если Стр.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
			НовСтр.СпособДоставки  = "Самовывоз";
		ИначеЕсли Стр.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента Тогда
			НовСтр.СпособДоставки  = "Клиенту";
		ИначеЕсли Стр.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
			НовСтр.СпособДоставки  = "Перевозчику";
		ИначеЕсли Стр.СпособДоставки = Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки Тогда
			НовСтр.СпособДоставки  = "Перегрузка";
		КонецЕсли;
		
		НовСтр.ВремяДоставкиС   = Формат(Стр.ВремяДоставкиС, "ДФ=""ЧЧ:мм""");
		НовСтр.КоличествоПалет = Строка(Стр.КоличествоПалет) 
			+ ?(Стр.КоличествоПалет = Стр.КоличествоПалетРасчет, "", "  (" + Формат(Стр.КоличествоПалетРасчет, "ЧЦ=10; ЧДЦ=2")  + ")");
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДокументыПродажи()
	СкладыПродукции = Новый Массив();
	СкладыПродукции.Добавить(AMS_ВызовСервера.СкладПродукции());
	СкладыПродукции.Добавить(AMS_ВызовСервера.СкладЗолушки());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекДата", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("СкладыПродукции", СкладыПродукции);
	Запрос.УстановитьПараметр("ГруппаДоступа", ГруппаДоступа);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Ссылка КАК ГрафикОплаты,
	|	т.Сдвиг КАК Сдвиг
	|ПОМЕСТИТЬ Сроки
	|ИЗ
	|	Справочник.ГрафикиОплаты.Этапы КАК т
	|ГДЕ
	|	т.Сдвиг = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.ДатаОтгрузки КАК ДатаОтгрузки,
	|	т.Ссылка КАК ЗаказКлиента,
	|	ВЫБОР
	|		КОГДА т.ПометкаУдаления
	|			ТОГДА 1
	|		КОГДА т.Проведен
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК СостоянияЗаказ,
	|	т.Номер КАК Номер,
	|	т.Дата КАК Дата,
	|	т.AMS_Резерв КАК ЗаказКлиентаРезерв,
	|	т.Организация КАК Организация,
	|	т.Партнер КАК Партнер,
	|	т.Партнер.ГруппаДоступа КАК ГруппаДоступа,
	|	т.Партнер.AMS_Лимит КАК Лимит,
	|	т.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(Сроки.Сдвиг, 1) КАК Срок,
	|	т.СуммаДокумента КАК СуммаДокумента,
	|	ВЫБОР
	|		КОГДА т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА т.АдресДоставкиПеревозчика
	|		ИНАЧЕ т.АдресДоставки
	|	КОНЕЦ КАК АдресДоставки,
	|	т.СпособДоставки КАК СпособДоставки,
	|	т.AMS_УсловияОтгрузки КАК УсловияОтгрузки,
	|	т.ВремяДоставкиС КАК ВремяДоставкиС,
	|	т.AMS_КоличествоПалет КАК КоличествоПалет,
	|	т.AMS_КоличествоПалетРасчет КАК КоличествоПалетРасчет,
	|	т.AMS_КоличествоУпаковок КАК КоличествоУпаковок,
	|	т.AMS_Вес КАК Вес,
	|	т.AMS_Объем КАК Объем,
	|	т.Комментарий КАК Комментарий,
	|	т.Автор КАК Автор,
	|	т.Менеджер КАК Менеджер,
	|	т.AMS_ЦенаИзменена КАК ЦенаИзмененаЗаказ,
	|	т.AMS_ID КАК В2В,
	|	ВЫБОР
	|		КОГДА НЕ т.Проведен
	|			ТОГДА ЛОЖЬ
	|		КОГДА т.ДатаОтгрузки <> ДАТАВРЕМЯ(1, 1, 1)
	|				И &ТекДата > т.ДатаОтгрузки
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПросроченЗаказ,
	|	т.AMS_Тендер КАК Тендер
	|ПОМЕСТИТЬ Заказы
	|ИЗ
	|	Документ.ЗаказКлиента КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Сроки КАК Сроки
	|		ПО т.Соглашение.ГрафикОплаты = Сроки.ГрафикОплаты
	|ГДЕ
	|	т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|	И т.Склад В (&СкладыПродукции)
	|	И т.Дата >= ДОБАВИТЬКДАТЕ(&ТекДата, МЕСЯЦ, -3)
	|	И НЕ т.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(т.Дата, ДЕНЬ) КАК ДатаОтгрузки,
	|	т.Ссылка КАК Реализация,
	|	ВЫБОР
	|		КОГДА т.ПометкаУдаления
	|			ТОГДА 1
	|		КОГДА т.Проведен
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК СостоянияРеализация,
	|	т.Номер КАК НомерРеализация,
	|	т.Дата КАК ДатаРеализация,
	|	т.Проведен КАК ПроведенРеализация,
	|	т.Организация КАК Организация,
	|	т.Партнер КАК Партнер,
	|	т.Партнер.ГруппаДоступа КАК ГруппаДоступа,
	|	т.Партнер.AMS_Лимит КАК Лимит,
	|	т.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(Сроки.Сдвиг, 1) КАК Срок,
	|	т.СуммаДокумента КАК СуммаДокумента,
	|	ВЫБОР
	|		КОГДА т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА т.АдресДоставкиПеревозчика
	|		ИНАЧЕ т.АдресДоставки
	|	КОНЕЦ КАК АдресДоставки,
	|	т.СпособДоставки КАК СпособДоставки,
	|	т.AMS_УсловияОтгрузки КАК УсловияОтгрузки,
	|	т.ВремяДоставкиС КАК ВремяДоставкиС,
	|	т.AMS_КоличествоПалет КАК КоличествоПалет,
	|	т.AMS_КоличествоПалетРасчет КАК КоличествоПалетРасчет,
	|	т.AMS_КоличествоУпаковок КАК КоличествоУпаковок,
	|	т.AMS_Вес КАК Вес,
	|	т.AMS_Объем КАК Объем,
	|	т.Комментарий КАК Комментарий,
	|	т.Автор КАК Автор,
	|	т.Менеджер КАК Менеджер,
	|	т.AMS_ЦенаИзменена КАК ЦенаИзмененаРеализация,
	|	т.AMS_ID КАК В2В,
	|	ВЫБОР
	|		КОГДА НЕ т.Проведен
	|			ТОГДА ЛОЖЬ
	|		КОГДА т.Дата <> ДАТАВРЕМЯ(1, 1, 1)
	|				И &ТекДата > т.Дата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПросроченРеализация,
	|	т.ЗаказКлиента КАК ЗаказКлиента,
	|	т.AMS_ЗаказКлиентаНомер КАК ЗаказКлиентаНомер,
	|	т.AMS_УтвержденаОтгрузка КАК УтвержденаОтгрузка,
	|	ЛОЖЬ КАК Тендер
	|ПОМЕСТИТЬ Реализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Сроки КАК Сроки
	|		ПО т.Соглашение.ГрафикОплаты = Сроки.ГрафикОплаты
	|ГДЕ
	|	т.Склад В (&СкладыПродукции)
	|	И т.Дата >= ДОБАВИТЬКДАТЕ(&ТекДата, МЕСЯЦ, -3)
	|	И т.AMS_СтатусРеализации В (ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.Заказ), ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.Стикерование), ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.КОтгрузке))
	|	И НЕ т.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(т.Дата, ДЕНЬ),
	|	т.Ссылка,
	|	ВЫБОР
	|		КОГДА т.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|				КОГДА т.Проведен
	|					ТОГДА 0
	|				ИНАЧЕ 2
	|			КОНЕЦ
	|	КОНЕЦ,
	|	т.Номер,
	|	т.Дата,
	|	т.Проведен,
	|	т.Организация,
	|	т.Партнер,
	|	т.Партнер.ГруппаДоступа,
	|	т.Партнер.AMS_Лимит,
	|	т.Контрагент,
	|	ЕСТЬNULL(Сроки.Сдвиг, 1),
	|	т.СуммаДокумента,
	|	ВЫБОР
	|		КОГДА т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА т.АдресДоставкиПеревозчика
	|		ИНАЧЕ т.АдресДоставки
	|	КОНЕЦ,
	|	т.СпособДоставки,
	|	т.AMS_УсловияОтгрузки,
	|	т.ВремяДоставкиС,
	|	т.AMS_КоличествоПалет,
	|	т.AMS_КоличествоПалетРасчет,
	|	т.AMS_КоличествоУпаковок,
	|	т.AMS_Вес,
	|	т.AMS_Объем,
	|	т.Комментарий,
	|	т.Автор,
	|	т.Менеджер,
	|	т.AMS_ЦенаИзменена,
	|	ВЫБОР
	|		КОГДА т.AMS_ID = 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ т.Проведен
	|			ТОГДА ЛОЖЬ
	|		КОГДА т.Дата <> ДАТАВРЕМЯ(1, 1, 1)
	|				И &ТекДата > т.Дата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	т.ЗаказКлиента,
	|	т.AMS_ЗаказКлиентаНомер,
	|	т.AMS_УтвержденаОтгрузка,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ОтгрузкаТоваровКлиенту КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Сроки КАК Сроки
	|		ПО т.Соглашение.ГрафикОплаты = Сроки.ГрафикОплаты
	|ГДЕ
	|	т.Склад В (&СкладыПродукции)
	|	И т.Дата >= ДОБАВИТЬКДАТЕ(&ТекДата, МЕСЯЦ, -3)
	|	И т.AMS_СтатусРеализации В (ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.Заказ), ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.Стикерование), ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.КОтгрузке))
	|	И НЕ т.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(Реализации.ДатаОтгрузки, Заказы.ДатаОтгрузки) КАК ДатаОтгрузки,
	|	Заказы.ЗаказКлиента КАК ЗаказКлиента,
	|	Заказы.СостоянияЗаказ КАК СостоянияЗаказ,
	|	Заказы.Номер КАК Номер,
	|	Заказы.Дата КАК Дата,
	|	ЕСТЬNULL(Заказы.ЗаказКлиентаРезерв, ЛОЖЬ) КАК ЗаказКлиентаРезерв,
	|	Реализации.Реализация КАК Реализация,
	|	Реализации.СостоянияРеализация КАК СостоянияРеализация,
	|	Реализации.НомерРеализация КАК НомерРеализация,
	|	Реализации.ДатаРеализация КАК ДатаРеализация,
	|	ЕСТЬNULL(Реализации.ПроведенРеализация, ЛОЖЬ) КАК ПроведенРеализация,
	|	ЕСТЬNULL(Реализации.Организация, Заказы.Организация) КАК Организация,
	|	ЕСТЬNULL(Реализации.Партнер, Заказы.Партнер) КАК Клиент,
	|	ЕСТЬNULL(Реализации.ГруппаДоступа, Заказы.ГруппаДоступа) КАК ГруппаДоступа,
	|	ЕСТЬNULL(Реализации.Лимит, Заказы.Лимит) КАК Лимит,
	|	ЕСТЬNULL(Реализации.Контрагент, Заказы.Контрагент) КАК Контрагент,
	|	ЕСТЬNULL(Реализации.Срок, Заказы.Срок) КАК Срок,
	|	ЕСТЬNULL(Реализации.СуммаДокумента, Заказы.СуммаДокумента) КАК СуммаДокумента,
	|	ЕСТЬNULL(Реализации.АдресДоставки, Заказы.АдресДоставки) КАК АдресДоставки,
	|	ЕСТЬNULL(Реализации.СпособДоставки, Заказы.СпособДоставки) КАК СпособДоставки,
	|	ЕСТЬNULL(Реализации.УсловияОтгрузки, Заказы.УсловияОтгрузки) КАК УсловияОтгрузки,
	|	ЕСТЬNULL(Реализации.ВремяДоставкиС, Заказы.ВремяДоставкиС) КАК ВремяДоставкиС,
	|	ЕСТЬNULL(Реализации.КоличествоПалет, Заказы.КоличествоПалет) КАК КоличествоПалет,
	|	ЕСТЬNULL(Реализации.КоличествоПалетРасчет, Заказы.КоличествоПалетРасчет) КАК КоличествоПалетРасчет,
	|	ЕСТЬNULL(Реализации.КоличествоУпаковок, Заказы.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	ЕСТЬNULL(Реализации.Вес, Заказы.Вес) КАК Вес,
	|	ЕСТЬNULL(Реализации.Объем, Заказы.Объем) КАК Объем,
	|	ЕСТЬNULL(Реализации.Комментарий, Заказы.Комментарий) КАК Комментарий,
	|	ЕСТЬNULL(Реализации.Автор, Заказы.Автор) КАК Автор,
	|	ЕСТЬNULL(Реализации.Менеджер, Заказы.Менеджер) КАК Менеджер,
	|	Заказы.ЦенаИзмененаЗаказ КАК ЦенаИзмененаЗаказ,
	|	Реализации.ЦенаИзмененаРеализация КАК ЦенаИзмененаРеализация,
	|	ЕСТЬNULL(Реализации.В2В, Заказы.В2В) КАК В2В,
	|	Заказы.ПросроченЗаказ КАК ПросроченЗаказ,
	|	Реализации.ПросроченРеализация КАК ПросроченРеализация,
	|	ЕСТЬNULL(Реализации.УтвержденаОтгрузка, ЛОЖЬ) КАК УтвержденаОтгрузка,
	|	ЕСТЬNULL(Реализации.Тендер, Заказы.Тендер) КАК Тендер
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Заказы КАК Заказы
	|		ПОЛНОЕ СОЕДИНЕНИЕ Реализации КАК Реализации
	|		ПО Заказы.Номер = Реализации.ЗаказКлиентаНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Распоряжение КАК Распоряжение,
	|	ИСТИНА КАК ЕстьЛист
	|ПОМЕСТИТЬ Лл
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.Распоряжения КАК т
	|ГДЕ
	|	т.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление._СтатусыДоставки.Погрузка)
	|	И т.Ссылка.Проведен
	|	И т.Распоряжение В
	|			(ВЫБРАТЬ
	|				вт.ЗаказКлиента КАК Распоряжение
	|			ИЗ
	|				вт КАК вт
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				вт.Реализация
	|			ИЗ
	|				вт КАК вт)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	вт.Организация КАК Организация,
	|	вт.Клиент КАК Клиент
	|ПОМЕСТИТЬ Клиенты
	|ИЗ
	|	вт КАК вт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Клиенты.Организация КАК Организация,
	|	Клиенты.Клиент КАК Клиент,
	|	т.ОбъектРасчетов КАК ОбъектРасчетов,
	|	т.РасчетныйДокумент КАК РасчетныйДокумент,
	|	т.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	т.ДатаВозникновения КАК ДатаВозникновения,
	|	т.ПредоплатаОстаток КАК Предоплата,
	|	т.ДолгОстаток КАК ДолгКлиента,
	|	ВЫБОР
	|		КОГДА т.ДатаПлановогоПогашения > &ТекДата
	|			ТОГДА 0
	|		ИНАЧЕ т.ДолгОстаток
	|	КОНЕЦ КАК ДолгКлиентаПросрочен,
	|	т.АналитикаУчетаПоПартнерам.Организация КАК Организация1,
	|	т.АналитикаУчетаПоПартнерам.Партнер КАК Клиент1
	|ПОМЕСТИТЬ Расчеты
	|ИЗ
	|	Клиенты КАК Клиенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&ТекДата, ) КАК т
	|		ПО Клиенты.Организация = т.АналитикаУчетаПоПартнерам.Организация
	|			И Клиенты.Клиент = т.АналитикаУчетаПоПартнерам.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.Организация КАК Организация,
	|	Расчеты.Клиент КАК Клиент,
	|	СУММА(Расчеты.Предоплата) КАК Предоплата,
	|	СУММА(Расчеты.ДолгКлиента) КАК ДолгКлиента,
	|	СУММА(Расчеты.ДолгКлиентаПросрочен) КАК ДолгКлиентаПросрочен
	|ПОМЕСТИТЬ Долг
	|ИЗ
	|	Расчеты КАК Расчеты
	|
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Организация,
	|	Расчеты.Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	вт.Реализация КАК Реализация,
	|	МАКСИМУМ(Ист.Период) КАК ДатаСН
	|ПОМЕСТИТЬ СН
	|ИЗ
	|	вт КАК вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.AMS_ИсторияРеализации КАК Ист
	|		ПО вт.Реализация = Ист.Документ
	|			И (Ист.Событие = ЗНАЧЕНИЕ(Перечисление.AMS_СобытияРеализации.ПечатьСН))
	|
	|СГРУППИРОВАТЬ ПО
	|	вт.Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	вт.Реализация КАК Реализация,
	|	МАКСИМУМ(Ист.Период) КАК ДатаУПД
	|ПОМЕСТИТЬ УПД
	|ИЗ
	|	вт КАК вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.AMS_ИсторияРеализации КАК Ист
	|		ПО вт.Реализация = Ист.Документ
	|			И (Ист.Событие = ЗНАЧЕНИЕ(Перечисление.AMS_СобытияРеализации.ПечатьУПД)
	|				ИЛИ Ист.Событие = ЗНАЧЕНИЕ(Перечисление.AMS_СобытияРеализации.ПечатьТОРГ12))
	|
	|СГРУППИРОВАТЬ ПО
	|	вт.Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	вт.Реализация КАК Реализация,
	|	МАКСИМУМ(Ист.Период) КАК ДатаОтмены
	|ПОМЕСТИТЬ Отмена
	|ИЗ
	|	вт КАК вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.AMS_ИсторияРеализации КАК Ист
	|		ПО вт.Реализация = Ист.Документ
	|			И (Ист.Событие = ЗНАЧЕНИЕ(Перечисление.AMS_СобытияРеализации.ОтменаПечати))
	|
	|СГРУППИРОВАТЬ ПО
	|	вт.Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	вт.Реализация КАК Реализация,
	|	ВЫБОР
	|		КОГДА Отмена.ДатаОтмены ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА СН.ДатаСН ЕСТЬ NULL
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СН.ДатаСН > Отмена.ДатаОтмены
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЕстьСН,
	|	ВЫБОР
	|		КОГДА Отмена.ДатаОтмены ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА УПД.ДатаУПД ЕСТЬ NULL
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА УПД.ДатаУПД > Отмена.ДатаОтмены
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЕстьУПД
	|ПОМЕСТИТЬ Печать
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ СН КАК СН
	|		ПО вт.Реализация = СН.Реализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ УПД КАК УПД
	|		ПО вт.Реализация = УПД.Реализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Отмена КАК Отмена
	|		ПО вт.Реализация = Отмена.Реализация
	|ГДЕ
	|	НЕ вт.Реализация ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	вт.ДатаОтгрузки КАК ДатаОтгрузки,
	|	вт.ЗаказКлиента КАК ЗаказКлиента,
	|	ЕСТЬNULL(вт.СостоянияЗаказ, 9) КАК СостоянияЗаказ,
	|	вт.Номер КАК Номер,
	|	вт.Дата КАК Дата,
	|	вт.Реализация КАК Реализация,
	|	ЕСТЬNULL(вт.СостоянияРеализация, 9) КАК СостоянияРеализация,
	|	вт.НомерРеализация КАК НомерРеализация,
	|	вт.ДатаРеализация КАК ДатаРеализация,
	|	вт.Организация КАК Организация,
	|	вт.Клиент КАК Клиент,
	|	вт.ГруппаДоступа КАК ГруппаДоступа,
	|	вт.Контрагент КАК Контрагент,
	|	вт.Срок КАК Срок,
	|	вт.СуммаДокумента КАК СуммаДокумента,
	|	вт.АдресДоставки КАК АдресДоставки,
	|	вт.СпособДоставки КАК СпособДоставки,
	|	вт.УсловияОтгрузки КАК УсловияОтгрузки,
	|	вт.ВремяДоставкиС КАК ВремяДоставкиС,
	|	вт.КоличествоПалет КАК КоличествоПалет,
	|	вт.КоличествоПалетРасчет КАК КоличествоПалетРасчет,
	|	вт.КоличествоУпаковок КАК КоличествоУпаковок,
	|	вт.Вес КАК Вес,
	|	вт.Объем КАК Объем,
	|	вт.Комментарий КАК Комментарий,
	|	вт.Автор КАК Автор,
	|	вт.Менеджер КАК Менеджер,
	|	вт.ЦенаИзмененаЗаказ КАК ЦенаИзмененаЗаказ,
	|	вт.ЦенаИзмененаРеализация КАК ЦенаИзмененаРеализация,
	|	вт.В2В КАК В2В,
	|	вт.ПросроченЗаказ КАК ПросроченЗаказ,
	|	вт.ПросроченРеализация КАК ПросроченРеализация,
	|	вт.Лимит КАК Лимит,
	|	ВЫБОР
	|		КОГДА вт.Лимит > 0
	|			ТОГДА ЕСТЬNULL(Долг.ДолгКлиента, 0) - вт.Лимит
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаЛимит,
	|	ВЫБОР
	|		КОГДА Долг.ДолгКлиентаПросрочен = 0
	|			ТОГДА NULL
	|		ИНАЧЕ Долг.ДолгКлиентаПросрочен
	|	КОНЕЦ КАК ДолгКлиентаПросрочен,
	|	ВЫБОР
	|		КОГДА Долг.Предоплата = 0
	|			ТОГДА NULL
	|		ИНАЧЕ Долг.Предоплата
	|	КОНЕЦ КАК ДолгНаш,
	|	вт.УтвержденаОтгрузка КАК УтвержденаОтгрузка,
	|	Печать.ЕстьСН КАК ЕстьСН,
	|	Печать.ЕстьУПД КАК ЕстьУПД,
	|	Лл.ЕстьЛист КАК ЕстьЛист,
	|	ВЫБОР
	|		КОГДА вт.ДатаОтгрузки < &ТекДата
	|			ТОГДА 1
	|		КОГДА вт.ПроведенРеализация
	|				И вт.УтвержденаОтгрузка
	|			ТОГДА 2
	|		КОГДА вт.ЗаказКлиентаРезерв
	|				ИЛИ вт.ПроведенРеализация
	|			ТОГДА 3
	|		КОГДА вт.Тендер
	|			ТОГДА 4
	|	КОНЕЦ КАК Цвет
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Лл КАК Лл
	|		ПО (вт.ЗаказКлиента = Лл.Распоряжение
	|				ИЛИ вт.Реализация = Лл.Распоряжение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Долг КАК Долг
	|		ПО вт.Организация = Долг.Организация
	|			И вт.Клиент = Долг.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Печать КАК Печать
	|		ПО вт.Реализация = Печать.Реализация";

	Если ЗначениеЗаполнено(ГруппаДоступа) Тогда	
		Запрос.Текст = Запрос.Текст + "
		|ГДЕ
		|	вт.ГруппаДоступа = &ГруппаДоступа";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОтгрузки,
	|	вт.Клиент.Наименование,
	|	вт.Номер";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти

#КонецЕсли
